%% matlab线性规划
%不等式约束和等式约束
%标准型满足<=的不等式约束和min的目标函数
% 例如：求 max z=0.4x1+0.28x2+2.32x3+0.72x4+0.64x5+0.6x6
%         s.t={ 0.01x1+0.01x2+0.01x3+0.03x4+0.03x5+0.03x6<=850
%             0.02x1+0.05x4<=700
%             0.02x2+0.05x5<=100
%             0.03x3+0.08x6<=900
%             x_j(j=1...6)>=0}
        
c=[-0.4 -0.28 -2.32 -0.72 -0.64 -0.6];
A=[0.01 0.01 0.01 0.03 0.03 0.03;0.02 0 0 0.05 0 0;0 0.02 0 0 0.05 0;0 0 0.03 0 0 0.08];%不等式系数
b=[850 700 100 900];%不等式值
Aeq=[];%等式约束系数
beq=[];%等式约束值
vlb=[0 0 0 0 0 0];%变量下限
vub=[];%变量上限
[x,fval]=linprog(c,A,b,Aeq,beq,vlb,vub);
