%% 数值积分
%高斯-勒让德求积公式
a=0;%积分下限
b=1;%积分上限
range=[a,b];%积分范围
gaosi=[0 0 2;
    1 sqrt(3)/3 1;
    1 -sqrt(3)/3 1;
    2 0 8/9;
    2 sqrt(3/5) 5/9;
    2 -sqrt(3/5) 5/9;
    3 0.3399810 0.65214515;
    3 -0.3399810 0.65214515; 
    3 0.86113631 0.34785486;
    3 -0.86113631 0.34785486;
     4 0 0.56888889;
     4 0.53846931 0.47862867;
     4 -0.53846931 0.47862867;
     4 0.90617985 0.23692689;
      4 -0.90617985 0.23692689];
%积分变化
n=input('请输入高斯-勒让德求积公式阶数n：');
fun1=@(x) sin(x)/x;%被积函数
fun2=@(x) sin((b+a)/2+(b-a)/2*x)/((b+a)/2+(b-a)/2*x);%变限函数
m=size(gaosi);
I=0;%求的积分值
for i=1:m(1)
    flag=gaosi(i,:);
    if(flag(1)==n)
        I=I+fun2(flag(2))*flag(3);
    end
end
disp('积分的高斯-勒让德估计值为')
disp(I*(b-a)/2);
        
        

  