load x.mat%加载判断矩阵
x=[1 2/5 1/5 6/5 7/5 8/5; 5/2 	11/2	6/2	7/2	8/2;5 2	1	 6	 7 	8; 5/6 2/6 1/6	1 7/6 8/6; 5/7	 2/7	1/7	6/7	1 8/7; 5/8	2/8	1/8	6/8	7/8	1]


[n,n]=size(x);
%% 一致性检验
[a,b]=eig(x);
bmax=max(max(b));
ci=(bmax-n)/(n-1)
ri=[0 0 0.52 0.89 1.12 1.26 1.36 1.41 1.46 1.49 1.52 1.54 1.56 1.58 1.59];
disp('一致性指标CI=');disp(ci);
cr = ci/ri(n);
disp('一致性比例CR=');disp(cr);
if cr<0.1
    disp('符合一致性检验')
else
    disp('不符合一致性检验，修正判断矩阵')
end
%% 特征值法计算权重矩阵
[r,c] = find(b==bmax , 1);
disp('特征值法求权重的结果为：');
m= a(:,c) ./ sum(a(:,c));
disp( m )%m为归一化后的权重
